# how to handling the mssing the vlaue

In [41]:
import pandas as pd
data=pd.read_csv('stock_data.csv')

In [42]:
data.head()

  tickers            eps  revenue price         people
0   GOOGL          27.82       87   845     larry page
1     WMT           4.61      484    65           n.a.
2    MSFT             -1       85    64     bill gates
3    RIL   not available       50  1023  mukesh ambani
4    TATA            5.6       -1  n.a.     ratan tata

In [66]:
da=pd.read_csv('stock_data.csv',na_values =['not available','n.a.'],na_filter=True)

In [67]:
da

  tickers    eps  revenue   price         people
0   GOOGL  27.82       87   845.0     larry page
1     WMT   4.61      484    65.0            NaN
2    MSFT  -1.00       85    64.0     bill gates
3    RIL     NaN       50  1023.0  mukesh ambani
4    TATA   5.60       -1     NaN     ratan tata

In [73]:
da.isnull()# it is provide true where null  is occur

   tickers    eps  revenue  price  people
0    False  False    False  False   False
1    False  False    False  False    True
2    False  False    False  False   False
3    False   True    False  False   False
4    False  False    False   True   False

In [74]:
da.notnull()# it is provide false where null  is occur

   tickers    eps  revenue  price  people
0     True   True     True   True    True
1     True   True     True   True   False
2     True   True     True   True    True
3     True  False     True   True    True
4     True   True     True  False    True

In [78]:
da.isnull().sum()# it find the sum of nulls in column

tickers    0
eps        1
revenue    0
price      1
people     1
dtype: int64

In [80]:
da.isnull().sum().sum() # it total sum of sum of nulls in csv file

3

In [82]:
da.notnull().sum() # it find notnull value in column

tickers    5
eps        4
revenue    5
price      4
people     4
dtype: int64

In [85]:
da.notnull().sum().sum() # it find  total notnull value in csv file

22

# above csv are imported.. 
# use dropna fuction

In [88]:
da

  tickers    eps  revenue   price         people
0   GOOGL  27.82       87   845.0     larry page
1     WMT   4.61      484    65.0            NaN
2    MSFT  -1.00       85    64.0     bill gates
3    RIL     NaN       50  1023.0  mukesh ambani
4    TATA   5.60       -1     NaN     ratan tata

In [90]:
da.dropna() #it drop row when null is occur

  tickers    eps  revenue  price      people
0   GOOGL  27.82       87  845.0  larry page
2    MSFT  -1.00       85   64.0  bill gates

In [93]:
da.dropna(axis=0) #it drop row when null is occur in row

  tickers    eps  revenue  price      people
0   GOOGL  27.82       87  845.0  larry page
2    MSFT  -1.00       85   64.0  bill gates

In [96]:
da.dropna(axis=1) #it drop column when null is present in any column

  tickers  revenue
0   GOOGL       87
1     WMT      484
2    MSFT       85
3    RIL        50
4    TATA       -1

In [97]:
da.dropna(how='any')

  tickers    eps  revenue  price      people
0   GOOGL  27.82       87  845.0  larry page
2    MSFT  -1.00       85   64.0  bill gates

In [98]:
da.dropna(axis=1,how='any')

  tickers  revenue
0   GOOGL       87
1     WMT      484
2    MSFT       85
3    RIL        50
4    TATA       -1

In [101]:
da.dropna(how='all') # it drop row when   all value is null in row

  tickers    eps  revenue   price         people
0   GOOGL  27.82       87   845.0     larry page
1     WMT   4.61      484    65.0            NaN
2    MSFT  -1.00       85    64.0     bill gates
3    RIL     NaN       50  1023.0  mukesh ambani
4    TATA   5.60       -1     NaN     ratan tata

In [106]:
da.dropna(subset=['price'])

  tickers    eps  revenue   price         people
0   GOOGL  27.82       87   845.0     larry page
1     WMT   4.61      484    65.0            NaN
2    MSFT  -1.00       85    64.0     bill gates
3    RIL     NaN       50  1023.0  mukesh ambani

In [108]:
da.dropna(inplace=True) #it used for updation in dataset 
da

  tickers    eps  revenue  price      people
0   GOOGL  27.82       87  845.0  larry page
2    MSFT  -1.00       85   64.0  bill gates